АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыГТО/алк_ВыгрузкаИзКамерыГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзКамерыГТО</name>
  <basedOn>Document.алк_ЗагрузкаВКамеруГТО</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <attributes>
    <name>ДатаНачалаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыгрузкиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеруГТО</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Камера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПериодыСезоновПропарки/алк_ПериодыСезоновПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПериодыСезоновПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </resources>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_НормативыПропарки/алк_НормативыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НормативыПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.алк_ГрадацияПропарки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыГТО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиКамерыГТО", МассивРезультатовЗапроса[0].Выгрузить());  
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СервисныеПроцедурыИФункции
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка.ДатаНачалаВыгрузки КАК Период,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка КАК Регистратор,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка.Склад КАК СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка.Камера КАК КамераПропарки,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Порода КАК Порода,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Длина КАК Длина,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Сорт КАК Сотр,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Градация КАК Градация,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Объем КАК Количество,
		|	&ВидДвиженияРасход КАК ВидДвижения
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыГТО.Состав КАК алк_ВыгрузкаИзКамерыГТОСостав
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	&НаСервере
	Процедура ЗаполнитьНормативРагрузки(Состав,ДатаНачалаВыгрузки,ДатаОкончанияВыгрузкиНорматив) Экспорт 
		
		Если Состав.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ДатаНачалаВыгрузки) Тогда   
			ДатаОкончанияВыгрузкиНорматив = "";   
			Возврат;
		КонецЕсли;
		
		ГрадацияДокумента = Состав[0].Градация;
		
		Если НЕ ЗначениеЗаполнено(ГрадацияДокумента) Тогда  
			ДатаОкончанияВыгрузкиНорматив = "";
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ПОМЕСТИТЬ ВТ_Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.Градация,
		|	алк_НормативыПропаркиСрезПоследних.Сезон,
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
		|			&ДатаСреза,
		|			Градация В (&ГрадацииДокумента)
		|				И Сезон В
		|					(ВЫБРАТЬ
		|						ВТ_Сезон.Сезон
		|					ИЗ
		|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
		
		Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацияДокумента);
		Запрос.УстановитьПараметр("ДатаСреза", ДатаНачалаВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			ДатаОкончанияВыгрузкиНорматив = ДатаНачалаВыгрузки + Выборка.НормативЗагрузки * 3600;  
		КонецЦикла;
		
	КонецПроцедуры
	
#КонецЕсли
